Documents/ПоручениеЭкспедитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоручениеЭкспедитору</Name>
			<RegisterRecords>
				<xr:Item>InformationRegister.РСК_СтатусыВыполненияКонтрактов</xr:Item>
				<xr:Item>InformationRegister.РСК_АктВыдачиТСР</xr:Item>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пункт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтправительПолучательДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_АктВыдачиТСР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СтатусАктаВыдачиТСР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыАктовВыдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерРеестра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаРеестра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДатаНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_НомерЗаявки</Name>
					<Comment>РС Консалт: Трофимов Евгений 12.11.2022 Задача 21867</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/КонтактныеЛицаПартнеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛицаПартнеров</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияСвязи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоВизитке</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииСвязи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДокументУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РолиКонтактногоЛица</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольКонтактногоЛица</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛицПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесИспользовать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемИспользовать</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентЕдиницыДляОтчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоручениеЭкспедитору/Ext/ManagerModule.bsl
#Область ПодсистемаВесионирования
 
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	//принять решение о необходимости скрытия из отчетов по версиям реквизитов и табличных частей, 
	//имеющих техническое назначение. Для скрытия реквизитов и табличных частей необходимо в 
	//процедуре ПриОпределенииНастроекВерсионированияОбъектов модуля менеджера объекта добавить следующий код:
	
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	//Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
	//Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
 
#КонецОбласти
 
// Текст запроса данных печати акта выдачи ТСР
// 
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17536
//e1cib/data/Документ.Задание?ref=8c3621e5d045e076498c0cd0a57b495c
Функция ТекстЗапросаДанныхПечатиАктаВыдачиТСР() Экспорт

	Текст = 
		"ВЫБРАТЬ
		|	ПоручениеЭкспедитору.Ссылка КАК Акт,
		|	МАКСИМУМ(КонтактныеЛицаПартнеров.Ссылка) КАК ПредставительЗаявителя
		|ПОМЕСТИТЬ ПредставителиЗаявителей
		|ИЗ
		|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|		ПО ПоручениеЭкспедитору.Пункт = КонтактныеЛицаПартнеров.Владелец
		|ГДЕ
		|	НЕ КонтактныеЛицаПартнеров.ПометкаУдаления
		|	И ПоручениеЭкспедитору.Ссылка В(&МассивОбъектов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоручениеЭкспедитору.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаКонтракта,
		|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерКонтракта,
		|	ПоручениеЭкспедитору.Номер КАК НомерАкта,
		|	ПоручениеЭкспедитору.Дата КАК ДатаАкта,
		|	ПоручениеЭкспедитору.РСК_НомерРеестра КАК НомерРеестра,
		|	ПоручениеЭкспедитору.РСК_ДатаРеестра КАК ДатаРеестра,
		|	ЗаказКлиента.Организация КАК Организация,
		|	ПоручениеЭкспедитору.РСК_ТСР КАК ТСР,
		|	ПоручениеЭкспедитору.РСК_Количество КАК Количество,
		|	ПоручениеЭкспедитору.РСК_Цена КАК Цена,
		|	ЗаказКлиента.РСК_СрокДействияГК КАК СрокДействияГК,
		|	ЗаказКлиента.РСК_ОбъектПоставкиГК КАК ОбъектПоставки,
		|	ПоручениеЭкспедитору.РСК_НомерНаправления КАК НомерНаправления,
		|	ПоручениеЭкспедитору.РСК_ДатаНаправления КАК ДатаНаправления,
		|	ПоручениеЭкспедитору.Ссылка КАК Акт,
		|	ПоручениеЭкспедитору.АдресДоставки КАК АдресДоставки,
		|	ПоручениеЭкспедитору.ДатаВыполнения КАК ДатаВыдачи,
		|	НоменклатураКонтрагентов.НаименованиеПолное КАК ПолноеНаименованиеТСР,
		|	НоменклатураКонтрагентов.НаименованиеНоменклатуры КАК Модель,
		|	ВЫБОР
		|		КОГДА спрНоменклатура.НаименованиеПолное = """"
		|			ТОГДА спрНоменклатура.Наименование
		|		ИНАЧЕ спрНоменклатура.НаименованиеПолное
		|	КОНЕЦ КАК Номенклатура,
		|	ЗаказКлиента.РСК_ФИОПодписанта КАК ФИОПодписанта,
		|	ЗаказКлиента.РСК_ПоставщикГК КАК ПоставщикГК,
		|	ЗаказКлиента.РСК_АдресПоставщикаГК КАК АдресПоставщикаГК,
		|	ЗаказКлиента.РСК_ПредставительПоставщикаГК КАК ПредставительПоставщикаГК,
		|	ЗаказКлиента.РСК_ДоверенностьПредставителяГК КАК ДоверенностьПредставителяГК,
		|	ПоручениеЭкспедитору.Пункт КАК ПолучательСсылка,
		|	Партнеры.Наименование КАК ФИО,
		|	Партнеры.РСК_СНИЛС КАК СНИЛС,
		|	Партнеры.РСК_ДокументУЛ КАК ПаспортныеДанные,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.Наименование, Партнеры.Наименование) КАК ПолучательФИО,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.Наименование, """") КАК ФИОПредставителя,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.ДополнительнаяИнформация, """") КАК ДокументПодтверждающийПолномочия,
		|	ЕСТЬNULL(КонтактныеЛицаПартнеров.РСК_ДокументУЛ, """") КАК ПаспортПредставителя,
		|	ЕСТЬNULL(ПредставителиЗаявителей.ПредставительЗаявителя, ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка)) КАК ПредставительЗаявителя,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(НомераФилиалов.Значение, """") КАК СТРОКА(50)) КАК НомерФилиала,
		|	ПРЕДСТАВЛЕНИЕ(спрНоменклатура.ЕдиницаИзмерения) КАК ЕдИзм,
		|	спрНоменклатура.Артикул КАК Артикул
		|ИЗ
		|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
		|			ПО ПоручениеЭкспедиторуОснования.Основание = ЗаказКлиента.Ссылка
		|		ПО ПоручениеЭкспедитору.Ссылка = ПоручениеЭкспедиторуОснования.Ссылка
		|			И (ПоручениеЭкспедиторуОснования.НомерСтроки = 1)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
		|		ПО ПоручениеЭкспедитору.Пункт = Партнеры.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО ПоручениеЭкспедитору.РСК_ТСР = НоменклатураКонтрагентов.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
		|		ПО ПоручениеЭкспедитору.РСК_Номенклатура = спрНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПредставителиЗаявителей КАК ПредставителиЗаявителей
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|			ПО ПредставителиЗаявителей.ПредставительЗаявителя = КонтактныеЛицаПартнеров.Ссылка
		|		ПО ПоручениеЭкспедитору.Ссылка = ПредставителиЗаявителей.Акт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК НомераФилиалов
		|		ПО ПоручениеЭкспедитору.Пункт = НомераФилиалов.Объект
		|			И (НомераФилиалов.Свойство.Имя = ""НомерФилиала"")
		|ГДЕ
		|	ПоручениеЭкспедитору.Ссылка В(&МассивОбъектов)
		|";

	
	Возврат Текст;

КонецФункции // ТекстЗапросаСбораДанных()

&После("ОбработкаПолученияПолейПредставления")
Процедура РСК_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17924
	//e1cib/data/Документ.Задание?ref=b6d469d456107fef47bae0d8601fa57f
	
	//Замена представления документов, в которых переключается интерфейс на подсистему «Выдача ТСР»
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("РСК_АктВыдачиТСР");
	//-- КонецЗадачи 17924
КонецПроцедуры

&После("ОбработкаПолученияПредставления")
Процедура РСК_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17924
	//e1cib/data/Документ.Задание?ref=b6d469d456107fef47bae0d8601fa57f
	
	//Замена представления документов, в которых переключается интерфейс на подсистему «Выдача ТСР»
	СтандартнаяОбработка = Ложь;
	Если Данные.РСК_АктВыдачиТСР Тогда
		Представление = "Акт выдачи ТСР ";
	Иначе
		Представление = "Поручение экспедитору ";
	КонецЕсли;
	Представление = Представление + Данные.Номер + " от " + Формат(Данные.Дата, "ДЛФ=DT");
	//-- КонецЗадачи 17924
КонецПроцедуры
